Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/carers/half_rate_carers_allowance.html.txt.tmx
Source language: en
Languages: ga

source: If you are getting certain social welfare payments and you are providing full-time care and attention to another person, you can keep your main social welfare payment and get a half-rate Carer’s Allowance as well
ga: Má fhaigheann tú íocaíochtaí leasa sóisialta áirithe agus tá cúram lán-aimseartha á sholáthar agat do dhuine eile, is féidir leat do phríomhíocaíocht leasa sóisialta a choinneáil agus Liúntas Cúramóra leath-ráta a fháil chomh maith

source: If you are in one of the following situations you may qualify for half-rate Carer's Allowance:
ga: Ma tá tú i gceann de na staideanna a leanas féadtar go mbéifeá incháilthe anois do Liúntas Cúramóra leath-ráta:

source: • Already getting Carer's Allowance but also meet the qualifying criteria for another social welfare payment
ga: • D'athraigh tú ó íocaíocht leasa sóisialta eile go Liúntas Cúramóra

source: If you are getting Carer's Allowance and you also meet the qualifying conditions for another social welfare payment (for example, a State pension) you should apply for the other payment
ga: Ma fhaigheann tú Liúntas Cúramóra agus comhlíonann tú na critéir cháilithe fosta maidir le híocaíocht leasa sóisialta eile (mar shampla Pinsean Stáit) ba chóir duit iarratas a chur isteach ar an íocaíocht eile

source: If you qualify for the other payment you will be paid it in full and keep half your Carer’s Allowance payment as well
ga: Ma tá tú incháilithe don íocaíocht eile íocfar duit ina iomláine í agus coinneoidh tú leath do Liúntais Cúramóra chomh maith

source: (For a list of social welfare payments paid with half-rate Carer's Allowance - see 'Rules' below)
ga: (Chun liosta íocaíochtaí leasa sóisialta atá iníoctha le Liúntas Cúramóra -feach 'Rialacha' thíos.)

source: If you are currently getting Carer’s Allowance and your spouse, civil partner or cohabitant is claiming another social welfare payment (for example, Jobseeker’s Allowance), your spouse, civil partner or cohabitant may claim an increase in their social welfare payment for you as a qualified adult and your Carer’s Allowance will be reduced by 50%
ga: Ma fhaigheann tú Liúntas Cúramóra faoi láthair agus tá íocaíocht leasa sóisialta eile á éileamh ag do chéile/pháirtnéir sibhialta/chomhchónaitheoir (mar shampla, Liúntas Cuardaitheora Poist), is féidir le do chéile/pháirtnéir sibhialta/chomhchónaitheoir méadú ina íocaíocht leasa sóisialta a éileamh ar do shonsa mar dhuine fásta cáilithe agus déanfar do Liúntas Cúramóra á laghdú faoi 50%

source: This can only be done with your consent but it may increase your total household income
ga: Ní féidir seo a dhéanamh ach amháin le do comhthoil ach féadtar go ndéanfadh sé d'ioncam teaghlaigh iomlán a mhéadú

source: • Changed from another social welfare payment to get Carer's Allowance
ga: Más rud é gur athraigh tú ó íocaíocht leasa sóisialta eile go Liúntas Cúramóra

source: If you were on another social welfare payment before claiming Carer's Allowance, you may get your original payment reinstated and also get half-rate Carer's Allowance, if you continue to meet the qualifying conditions for both schemes
ga: Más rud é go raibh tú ar íocaíocht leasa sóisialta eile roimh Liúntas Cúramóra a éileamh, féadtar go n-athchuirfear do bhuníocaíocht agus go bhfaighfidh tú Liúntas Cúramóra leath-ráta, má leanann tú coinníollacha don dá scéim a chomhlíonadh

source: (For a list of social welfare payments payable with half-rate Carer's Allowance - see 'Rules' below)
ga: (Chun liosta íocaíochtaí leasa sóisialta atá iníoctha le Liúntas Cúramóra - féach 'Rialacha' thíos)

source: • Caring for someone and being claimed for by a spouse, civil partner or cohabitant
ga: Más rud é go bhfuil cúram á thabhairt agat do dhuine éigin agus tá éileamh á dhéanamh ar do shon mar dhuine fásta atá ag brath ar íocaíocht leasa sóisialta do chéile/pháirtnéir sibhialta/chomhchónaitheoir

source: If your spouse, civil partner or cohabitant is claiming for you as a qualified adult on their payment and you are providing full-time care to another person, you can apply for half-rate Carer's Allowance and keep your current Increase for a Qualified Adult in full
ga: Má tá éileamh á dhéanamh ar do shon mar dhuine fásta cáilithe ar íocaíocht leasa sóisialta do chéile/pháirtnéir sibhialta/chomhchónaitheoir agus tá cúram lán-aimseartha á thabhairt agat do dhuine eile, is féidir leat iarratas a chur isteach ar Liúntas Cúramóra anois agus do Mhéadú le haghaidh Duine Fásta Cáilithe a choinneáil ina iomláine

source: • Getting a social welfare payment other than Carer's Allowance and caring for someone
ga: Má tá íocaíocht leasa sóisialta á fáil agat (seachas Liúntas Cúramóra) agus tá cúram á thabhairt agat do dhuine éigin

source: If you are getting one of the social welfare payments payable with half-rate Carer's Allowance (see 'Rules' below) and caring for someone, you may keep your social welfare payment and qualify for half-rate Carer’s Allowance
ga: Má tá ceann de na íocaíochtaí leasa sóisialta á fháil agat atá iníoctha anois le Liúntas Cúramóra (féach 'Rialacha' thíos) agus tá cúram á thabhairt agat do dhuine éigin, is féidir leat d'íocaíocht leasa sóisialta a choinneáil agus a bheith incháilthe do Liúntas Cúramóra leath-ráta

source: If your youngest child is aged between 7 and 15 inclusive you must qualify for Carer's Allowance to continue to qualify for OFP
ga: Caithfidh tú critéir cháilithe do Liúntas Cúramóra a chomhlíonadh

source: You will also get an Increase for a Qualified Child (IQC) for any other children in the family until they reach 18 (or 22 if in full-time education) while CA and OFP is in payment
ga: Mar shampla, caithfidh an duine dá bhfuil cúram á thabhairt a bheith chomh éagumasaithe ná go bhfuil cúram agus aird lán-aimseartha riachtanach agus caithfidh tú tástáil mhaoine a chomhlíonadh

source: (See our document on One-Parent Family Payment for more information on other exceptions to the age limits.)
ga: Léigh anseo chun tuilleadh eolais a fháil faoi na critéir cháilithe do Liúntas Cúramóra

source: You must meet the qualifying criteria for Carer’s Allowance. For example, the person you are caring for must be so incapacitated as to require full-time care and attention and you must satisfy a means test
ga: Má chomhlíonann tú na critéir do Liúntas Cúramóra dámhfar é ag 50% den ráta a bheadh infheidhmithe muna mbeadh aon íocaíocht eile á fáil agat

source: If you satisfy the conditions for Carer’s Allowance it will be awarded at 50% of the rate that would apply if you were not getting any other payment
ga: Beidh tú incháilithe fosta don Deontas Tacaíochta do Chúramóirí, Pacáiste Sochar Teaghlaigh agus Pas Saorthaistil

source: You can get half-rate Carer’s Allowance with the following weekly social welfare payments:
ga: Is féidir leat Liúntas Cúramóra a fháil chomh maith leis na híocaíochtaí leasa sóisialta seachtainiúla a leanas:

source: • State Pension (Contributory) and State Pension (Contributory) Increase for a Qualified Adult
ga: • Pinsean Stáit (Ranníocach) agus Méadú an Phinsin Stáit (Ranníocach) do Dhuine Fásta Cáilithe

source: • Invalidity Pension and Invalidity Pension Increase for a Qualified Adult
ga: • Pinsean Easláinte agus Méadú an Phinsin Easláinte do Dhuine Fásta Cáilithe

source: • Jobseeker's Benefit Increase for a Qualified Adult
ga: • Méadú an tSochair Chuardaitheora Poist do Dhuine Fásta Cáilithe

source: • Jobseeker's Allowance Increase for a Qualified Adult
ga: • Sochar Breoiteachta agus Méadú an tSocair Bhreoiteachta do Dhuine Fásta Cáilithe

source: • Illness Benefit and Illness Benefit Increase for a Qualified Adult
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Sochar Díobhála agus Méadú an tSocair Dhíobhala do Dhuine Fásta Cáilithe

source: • Health and Safety Benefit
ga: • Sochar Sláinte agus Sábháilteachta

source: • State Pension (Non-Contributory) and State Pension (Non-Contributory) Increase for a Qualified Adult
ga: • Pinsean Stáit (Neamh-ranníocach) agus Méadú an Phinsin Stáit (Neamh-ranníocach) do Dhuine Fásta Cáilithe

source: • Blind Pension and Blind Pension Increase for a Qualified Adult
ga: • Pinsean na nDall agus Méadú Phinsean na nDall do Dhuine Fásta Cáilithe

source: • Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: • Pre-Retirement Allowance and Pre-Retirement Allowance Increase for a Qualified Adult Allowance
ga: • Liúntais Réamhscoir agu Méadú an Liúntais Réamhscoir do Dhuine Fásta Cáilithe

source: • Disability Allowance and Disability Allowance Increase for a Qualified Adult
ga: • Méadú an tSochair Chuardaitheora Poist do Dhuine Fásta Cáilithe

source: • Incapacity Supplement and Incapacity Supplement Increase for a Qualified Adult
ga: • Liúntas Míchumais agus Méadú an Líuntais Mhíchumais do Dhuine Fásta Cáilithe

source: • Farm Assist and Farm Assist Increase for a Qualified Adult
ga: • Cúnamh Feirme agus Méadú an Chúnaimh Feirme do Dhuine Fásta Cáilithe

source: You cannot get half-rate Carer’s Allowance with the following social welfare payments:
ga: Ní féidir leat Liúntas Cúramóra a fháil leis na híocaíochtaí leasa sóisialta seachtainiúla a leanas:

source: • Basic Supplementary Welfare Allowance (SWA) and SWA Increase for a Qualified Adult
ga: • Liúntas Leasa Forlíontach agus Méadú an Liúntais Leasa Fhorlíontaigh do Dhuine Fasta Cáilithe

source: You cannot get Jobseeker's Benefit (JB) or Jobseeker’s Allowance (JA) and half-rate Carer's Allowance because you must be actively seeking employment and be available to take up employment to qualify for JA and JB
ga: Ní féidir leat Sochar Cuardaitheora Poist (SCP) nó Liúntas Cuardaitheora Poist (LCP) agus Liúntas Cúramóra leath-ráta a fháil mar caithfidh tú a bheith ag cuardach fostaíochta go gníomhach agus a bheith ábalta fostaíocht a ghlacadh le bheith incháilithe do SCP agus LCP

source: However, you may qualify for half-rate Carer's Allowance if your spouse, civil partner or cohabitant is getting JA or JB and claiming for you as a qualified adult
ga: Féadtar go mbéifeá incháilithe do Líuntas Cúramóra leath-rata má tá SCP nó LCP á fháil ag do cheile/pháirtnéir sibhialta/chomhchónaithe agus tá éileamh á dhéanamh ar do shon mar chleithiúnaí fásta cáilithe

source: Maximum half-rate Carer's Allowance from March 2017
ga: Rataí ó Márta 2017

source: │Half-rate Carer's Allowance │Under 66 │Age 66 and over │
ga: │Liúntas Cúramóra leath-ráta │Faoi aois 66 (ó 16 │Thar aois 66 agus níos sine (ó 9 │

source: │Caring for one person │€104.50 │€123.50 │
ga: │Ag tabhairt cúraim do dhuine │€104.50 │€123.50 │

source: │Caring for two or more │€156.75 │€185.25 │
ga: │Ag tabhairt cúraim do bheirt │€156.75 │€185.25 │

source: Any increase you may be entitled to, for example, an increase for a qualified child, living alone and living on an offshore island will be paid with your main social welfare payment and not with the half-rate Carer’s Allowance
ga: Íocfar aon mhéadú lena mbeidh tú i dteideal, mar shampla méadú do pháiste spleách, as bheith i do chónaí i d'aonair nó ar oileán amach ón chósta, le do phríomhíocaíocht leasa sóisialta agus ní íocfar leis an Liúntas Cúramóra leath-ráta é

source: Half-rate Carer’s Allowance is not a new scheme
ga: Conas iarratas a dhéanamh

source: To apply fill in an application form for Carer's Allowance (pdf). (You can also contact your social welfare local office for a copy of this form)
ga: Íoslódáil foirm iarratais do Liúntas Cúramóra (pdf) nó déan teagmháil le d'oifig Leasa Sóisialta áitiúil chun cóip den fhoirm seo a fháil

source: Forward the completed application form with the relevant certificates to Carer's Allowance Section at the Department of Social Protection - see 'Where to apply' below
ga: Seol an fhoirm chomhlánta leis na teastais ábhartha chuig Rannóg an Liúntais Chúramóra ag an Roinn Coimirce Sóisialaí - féach an seoladh thíos
